vlm/extension/Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТехнологическиеОперации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередаточнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПовторить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентТехнологическогоПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/extension/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>День</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Catalogs/ТехнологическиеОперации/Forms/ФормаОперации/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	//Нормы выработки
	НоваяГруппа = Элементы.Добавить("бит_НормыВыработки", Тип("ГруппаФормы"),Элементы.СтраницаОсновное);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Заголовок = "(бит) Нормы выработки";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	
	НоваяПодГруппа = Элементы.Добавить("бит_ПодгруппаНормыВыработки", Тип("ГруппаФормы"), НоваяГруппа);
	НоваяПодГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяПодГруппа.Заголовок = "";
	НоваяПодГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяПодГруппа.ОтображатьЗаголовок = Ложь;

	//(бит) Норма выработки
	НовыйЭлемент = Элементы.Добавить("бит_НормаВыработки", Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НормаВыработки";  
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_НормаВыработкиПриИзменении");
	//НовыйЭлемент.ТолькоПросмотр = ИСТИНА; 
	НовыйЭлемент.Ширина = 15;               
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.27 доработка логики]  [VUVaynula@1cbit.ru] [15.12.2025 13:46:23] +        
	НовыйЭлемент = Элементы.Добавить("бит_РучнойВводНормыВыработки", Тип("ПолеФормы"), НоваяПодГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_РучнойВводНормыВыработки"; 
	// }}ПервыйБИТ ЛистТребований [ЛТ5.27 доработка логики]  [VUVaynula@1cbit.ru] [15.12.2025 13:46:23] -

	
	//(бит) Количество ходов
	НовыйЭлемент = Элементы.Добавить("бит_КоличествоХодов", Тип("ПолеФормы"), Элементы.бит_НормыВыработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоличествоХодов"; 
	НовыйЭлемент.Ширина = 15; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_КоличествоХодовПриИзменении");
	
	//(бит) Норма времени
	НовыйЭлемент = Элементы.Добавить("бит_НормаВремени", Тип("ПолеФормы"), Элементы.бит_НормыВыработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_НормаВремени";  
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_НормаВремениПриИзменении");
	//НовыйЭлемент.ТолькоПросмотр = ИСТИНА; 
	НовыйЭлемент.Ширина = 15;
	
	//(бит) Технологическая скорость
	НовыйЭлемент = Элементы.Добавить("бит_ТехнологическаяСкорость", Тип("ПолеФормы"), Элементы.бит_НормыВыработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ТехнологическаяСкорость";
	НовыйЭлемент.Ширина = 15; 
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ТехнологическаяСкоростьПриИзменении");
	
	//(бит) Расчетная масса провода
	НовыйЭлемент = Элементы.Добавить("бит_РасчетнаяМассаПровода", Тип("ПолеФормы"), Элементы.бит_НормыВыработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_РасчетнаяМассаПровода";
	НовыйЭлемент.Ширина = 15;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_РасчетнаяМассаПроводаПриИзменении");
	
	//(бит) Коэффициент использования оборудования
	НовыйЭлемент = Элементы.Добавить("бит_КоэффициентИспользованияОборудования", Тип("ПолеФормы"), Элементы.бит_НормыВыработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КоэффициентИспользованияОборудования";
	НовыйЭлемент.Ширина = 15;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_КоэффициентИспользованияОборудованияПриИзменении");
	
	//(бит) Выработка провода со всей машины
	НовыйЭлемент = Элементы.Добавить("бит_ВыработкаПроводаСоВсейМашины", Тип("ПолеФормы"), Элементы.бит_НормыВыработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ВыработкаПроводаСоВсейМашины";  
	//НовыйЭлемент.ТолькоПросмотр = ИСТИНА;    
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ВыработкаПроводаСоВсейМашиныПриИзменении");
	НовыйЭлемент.Ширина = 15;
	
	Элементы.ВремяШтучное.УстановитьДействие("ПриИзменении", "бит_ОперацияВремяШтучноеПриИзменении");
	Элементы.ВремяШтучноеЕдИзм.УстановитьДействие("ПриИзменении", "бит_ОперацияВремяШтучноеЕдИзмПриИзменении");
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ33]  [VUVaynula@1cbit.ru] [03.02.2025 13:03:13] +        
	НовыйЭлемент = Элементы.Добавить("бит_КодОперации", Тип("ПолеФормы"), Элементы.ГруппаШапкиЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_КодОперации";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзменениибит_КодОперации");
	
	НовыйЭлемент = Элементы.Добавить("бит_АгрегирующийКоэффициент", Тип("ПолеФормы"), Элементы.ГруппаШапкиЛево);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_АгрегирующийКоэффициент"; 
	// }}ПервыйБИТ ЛистТребований [ЛТ33]  [VUVaynula@1cbit.ru] [03.02.2025 13:03:13] -
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриИзменениибит_КодОперации(Элемент)
// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [30.11.2025 19:56:41] +        
	Объект.Наименование = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.бит_КодОперации, "НаименованиеОперации");
// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [30.11.2025 19:56:41] -	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВыработкаПроводаСоВсейМашиныПриИзменении()
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [30.11.2025 20:00:10] +        
	ПриИзмененииВыработкиВсейМашиныНаСервере();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [30.11.2025 20:00:10] -
КонецПроцедуры                                                

&НаСервере
Процедура ПриИзмененииВыработкиВсейМашиныНаСервере()
	// {{ПервыйБИТ ЛистТребований [ЛТ.31]  [VUVaynula@1cbit.ru] [30.11.2025 20:30:18] +        
	//(бит) Норма выработки, тн = (бит) Выработка со всей машины, тн 
	Если Объект.бит_РучнойВводНормыВыработки Тогда
		Если Объект.бит_НормаВыработки = Объект.бит_ВыработкаПроводаСоВсейМашины Тогда
			Объект.бит_РучнойВводНормыВыработки = Ложь;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Объект.бит_НормаВыработки = Объект.бит_ВыработкаПроводаСоВсейМашины;  
	//(бит) Норма времени, ч" = 1/(бит) Выработка со всей машины, тн
	Если Объект.бит_ВыработкаПроводаСоВсейМашины <> 0 Тогда 
    	Объект.бит_НормаВремени = 1 / Объект.бит_ВыработкаПроводаСоВсейМашины;  
	Иначе
		Объект.бит_НормаВремени = 0;
	КонецЕсли;     
	Объект.ВремяШтучное = Объект.бит_НормаВремени * 60;
	Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута;
	//Остальное рассчитается при записи
	// }}ПервыйБИТ ЛистТребований [ЛТ.31]  [VUVaynula@1cbit.ru] [30.11.2025 20:30:18] -
КонецПроцедуры

&НаКлиенте
Процедура бит_КоличествоХодовПриИзменении() 
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины();	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -

КонецПроцедуры  

&НаКлиенте
Процедура бит_НормаВыработкиПриИзменении()       
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [09.12.2025 17:32:20] +        
	Если Объект.бит_НормаВыработки = 0 Тогда
		Объект.бит_НормаВремени = 0;
		Объект.ВремяШтучное = 0;
	Иначе		
		Объект.ВремяШтучноеЕдИзм = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Минута");
		Объект.бит_НормаВремени = 1 / Объект.бит_НормаВыработки;
		Объект.ВремяШтучное = Объект.бит_НормаВремени * 60; 
	КонецЕсли;	    
	бит_НормаВремениПриИзменении();                                                                            
	
	Объект.бит_РучнойВводНормыВыработки = Объект.бит_ВыработкаПроводаСоВсейМашины <> Объект.бит_НормаВыработки;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [09.12.2025 17:32:20] -
КонецПроцедуры  

&НаКлиенте
Процедура бит_НормаВремениПриИзменении()
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [09.12.2025 17:34:42] +        
	Если Объект.бит_НормаВремени = 0 Тогда
		Объект.ВремяШтучное = 0;
	Иначе		
		Объект.ВремяШтучноеЕдИзм = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Минута");
		Объект.ВремяШтучное = Объект.бит_НормаВремени * 60; 
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [09.12.2025 17:34:42] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ТехнологическаяСкоростьПриИзменении()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +

	бит_ПересчитатьВыработкуПроводаСоВсейМашины();	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -

КонецПроцедуры  

&НаКлиенте
Процедура бит_РасчетнаяМассаПроводаПриИзменении()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины();	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
КонецПроцедуры  

&НаКлиенте
Процедура бит_КоэффициентИспользованияОборудованияПриИзменении()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	бит_ПересчитатьВыработкуПроводаСоВсейМашины();	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
КонецПроцедуры  

&НаСервере
Процедура бит_ПересчитатьВыработкуПроводаСоВсейМашины()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	Объект.бит_ВыработкаПроводаСоВсейМашины = ((Объект.бит_ТехнологическаяСкорость * 6 / 100) 
																		* Объект.бит_РасчетнаяМассаПровода 
																		* Объект.бит_КоличествоХодов 
																		* Объект.бит_КоэффициентИспользованияОборудования);	
																		
	ПриИзмененииВыработкиВсейМашиныНаСервере();																	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОперацияВремяШтучноеПриИзменении()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	бит_ПересчитатьНормыВремениВыработки();	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОперацияВремяШтучноеЕдИзмПриИзменении()
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	бит_ПересчитатьНормыВремениВыработки();	
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
КонецПроцедуры

&НаСервере
Процедура бит_ПересчитатьНормыВремениВыработки()  
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 +
	
	Если Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда 					
		Объект.бит_НормаВремени = Объект.ВремяШтучное; //Час	
	ИначеЕсли Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда		
		Объект.бит_НормаВремени = Объект.ВремяШтучное / 60; //Минута
	ИначеЕсли Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Секунда Тогда	
		Объект.бит_НормаВремени = Объект.ВремяШтучное / 3600; //Секунда
	ИначеЕсли Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.День Тогда 		
		Объект.бит_НормаВремени = Объект.ВремяШтучное * 12; //День
	ИначеЕсли Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Сутки Тогда 		
		Объект.бит_НормаВремени = Объект.ВремяШтучное * 24; //Сутки 
	ИначеЕсли Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Месяц Тогда 		
		Объект.бит_НормаВремени = Объект.ВремяШтучное * 24 * 30; //Месяц
	ИначеЕсли Объект.ВремяШтучноеЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Год Тогда		
		Объект.бит_НормаВремени = Объект.ВремяШтучное * 24 * 30.4375 * 12; //Год
	КонецЕсли;
	                                                                   
	Если Объект.бит_НормаВремени = 0 Тогда
		Объект.бит_НормаВыработки = 0;
	Иначе		
		Объект.бит_НормаВыработки = 1 / Объект.бит_НормаВремени;
	КонецЕсли;
	
	//ПервыйБИТ ЛТ 1.6 KAKravchenko@1cbit.ru 06.02.2025 -
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВремяШтучноеПриИзмененииВместо(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [30.11.2025 21:00:01] +        
	// Отменить ранее реализованную логику пересчета реквизитов при изменении полей "Время выполнения".
	Возврат;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [30.11.2025 21:00:01] -
КонецПроцедуры

&НаСервере
Процедура бит_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [04.12.2025 20:34:04] +        
	//(бит) Норма времени, ч перевести в минуты и транслировать
	НормаВремениВМинутах = ТекущийОбъект.бит_НормаВремени * 60;
	// В поле "Длительность этапа" в вышестоящий этап операции в часах с округлением в большую сторону:              
	ВремяВЧасах = НормаВремениВМинутах/60; 
	// найти РесСпецификация, этап   по этой тех операции
	РесСпецификация = ТекущийОбъект.Спецификация.ПолучитьОбъект();   
	// В виды работ на вкладке "Трудозатраты", связанные с корректируемой операцией в единицах измерения вида работ "Часы":
	Для каждого стр из РесСпецификация.Трудозатраты Цикл
		Если стр.операция = Объект.ссылка 
			Или стр.ОперацияРедактирование = Объект.ссылка Тогда
			
			стр.Количество = ВремяВЧасах;
		КонецЕсли;
	КонецЦикла;                       
	РесСпецификация.Записать();
	
	// найдем этап запросом . первый этап у которого указана спецификация. по договоренности одна спецификация - один этап
	//Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//                      |	ЭтапПроизводства2_2.Ссылка КАК Ссылка
	//                      |ИЗ
	//                      |	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	//                      |ГДЕ
	//                      |	ЭтапПроизводства2_2.Проведен
	//                      |	И ЭтапПроизводства2_2.Спецификация = &Спецификация");	
	//Запрос.УстановитьПараметр("Спецификация", ТекущийОбъект.Спецификация);
	//ВыборкаЭтап = Запрос.Выполнить().Выбрать();                              
	Если ЗначениеЗаполнено(ТекущийОбъект.Спецификация.ОсновноеИзделиеЭтап) Тогда
		Этап = ТекущийОбъект.Спецификация.ОсновноеИзделиеЭтап.ПолучитьОбъект();
		Этап.ДлительностьЭтапа = бит_ОбщегоНазначенияСервер.ОкруглитьВверх(ВремяВЧасах);
		Этап.ЕдиницаИзмеренияДлительностиЭтапа = Перечисления.ЕдиницыИзмеренияВремени.Час;
		// В поле "Время работы" для видов рабочих центров, указанных в этапе в минутах:
		// Если указаны альтернативные рабочие центры, то время транслируется в них аналогично.  
		Для каждого стр из Этап.ВидыРабочихЦентров Цикл
			стр.ВремяРаботы = НормаВремениВМинутах;
			стр.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		КонецЦикла;   
	    // альтушки
		Для каждого стр из Этап.АльтернативныеВидыРабочихЦентров Цикл
			стр.ВремяРаботы = НормаВремениВМинутах;
			стр.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута;
		КонецЦикла; 
		Этап.Записать();
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.31]  [VUVaynula@1cbit.ru] [04.12.2025 20:34:04] -
КонецПроцедуры
